---
kind: property
id: P:Autodesk.Revit.DB.Visual.BumpMap.BumpmapBitmap
source: html/29a8c137-fcae-0c9d-5a19-cba289b5cdf9.htm
---
# Autodesk.Revit.DB.Visual.BumpMap.BumpmapBitmap Property

The property labeled "Source" from the "BumpMap" schema.

## Syntax (C#)
```csharp
public static string BumpmapBitmap { get; }
```

## Remarks
This property is of type "AssetPropertyString" and will contain a relative path.